OpenFOAM/foam9tutorials/CFD/rackStorage/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         120;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   30.;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDi           0.25;

maxDeltaT       0.01;
/*
functions
(
    HRR
    {
        type               cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //timeStep;  //outputTime;
        writeInterval      0.1;
        log                false;     
        valueOutput        false;
        source             all;       //cellZone;
        sourceName         c0;
        operation          volIntegrate;
        fields
        (
            dQ
        );
    }

    partialWrite
    {
        type            writeRegisteredObject;

        // Where to load it from
        functionObjectLibs ("libIOFunctionObjects.so");

        // Execute upon options:
        //  timeStep
        //  outputTime
        //  adjustableTime
        //  runTime
        //  clockTime
        //  cpuTime
        outputControl   adjustableTime;

        // Objects (fields or lagrangian fields in any of the clouds)
        // to write every outputTime
        objectNames    (dQ U T);

        exclusiveWriting     false;

        // Interval of time (sec) to write down(
        writeInterval   0.1; //(adjustableTime, runTime, clockTime, cpuTime)
    }
);
*/
// ************************************************************************* //
