OpenFOAM/foam9tutorials/CFD/rackStorage/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-2.1 0 -2.1)	// 0
    ( 2.1 0 -2.1)	// 1
    ( 2.1 6.6 -2.1)	// 2
    (-2.1 6.6 -2.1)	// 3
    (-2.1 0 2.1)	// 4
    ( 2.1 0 2.1)	// 5
    ( 2.1 6.6 2.1)	// 6
    (-2.1 6.6 2.1)	// 7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (14 22 14) simpleGrading (1 1 1) // 30 cm
);

edges           
(
);

patches         
(
    wall ground 
    (
        (0 1 5 4)
    )
    patch side 
    (
        (1 2 6 5)
        (0 3 2 1)
        (0 4 7 3)
        (6 7 4 5)
    )
    patch outlet
    (
        (7 6 2 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
