OpenFOAM/foam9tutorials/CFD/rackStorage/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          196;
        startFace       12124;
    }
    side
    {
        type            patch;
        nFaces          1232;
        startFace       12320;
    }
    outlet
    {
        type            patch;
        nFaces          196;
        startFace       13552;
    }
)

// ************************************************************************* //
