OpenFOAM/foam9tutorials/CFD/rackStorage/constant/panelRegion/reactions
species
(
    v
    char
);

gaseousSpecies
(
    gas
);

reactions
{
    charReaction
    {
        type        irreversibleArrheniusSolidReaction;
        reaction    "v^3.21 = char + gas";
        A           1.3e19;
        Ta          29829.2;
        Tcrit       400;
    }
}

