OpenFOAM/foam9tutorials/CFD/rackStorage/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi    3;         // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta  6;         // polar angles in PI (from Z to X-Y plane)
    convergence 1e-3;  // convergence criteria for radiation iteration
    maxIter 5;         // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 20;

absorptionEmissionModel constRadFractionEmission;

constRadFractionEmissionCoeffs
{
    //Proportionality constant (EhrrCoeff*HRR) to be emitted. Source term in RTE
    //Note: Use "radScaling true" for flame spread cases where Ehrr1 will be the radiative fraction of the burner (patch1) and Ehrr2 the radiative fraction of a flammable surface (patch2).
    EhrrCoeff           0.3;  
    radScaling		false;
    Ehrr1               0.3;
    Ehrr2		0.25;
    patch1		"burner";
    patch2		"region0_to_panelRegion_panel";
}

scatterModel    none;


// ************************************************************************* //
