OpenFOAM/foam9tutorials/CFD/rackStorage/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet         
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    } 

    ground          
    {
        type            fixedValue;
        value           $internalField;
    }

    side          
    {
        type            pressureInletOutletVelocity;
	phi		phi;
        value           $internalField;
    }

    burner          
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001294; //60kW  C3H8
        value           uniform (0 0 0);
    }

    region0_to_panelRegion_panel
    {
        type            flowRateInletVelocityPyrolysisCoupled;
        phi             phi;
        nbrPhi          phiGas;
        rho             rho;
        hocSolid        1.85e7;  //Hoc for virgin material
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
