OpenFOAM/foam9tutorials/CFD/rackStorage/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    outlet          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    burner          
    {
	type		fixedValue;
	value		$internalField;
    }
    region0_to_panelRegion_panel
    {
        type          compressible::turbulentTemperatureRadiationQinCoupledMixed;
        neighbourFieldName T;
        kappa           fluidThermo;
        kappaName       none;
        emissivityMode  solidRadiation;
        neighbourFieldRadiativeName none;
        value           $internalField;
    }
}

// ************************************************************************* //
