OpenFOAM/foam9tutorials/CFD/rackStorage/0/Ydefault
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          Ydefault;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    outlet      
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner          
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }

    region0_to_panelRegion_panel
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }
}

// ************************************************************************* //
