OpenFOAM/foam9tutorials/CFD/rackStorage/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          panelRegion;

faceZones       (panel);

oneD            true;

sampleMode      nearestPatchFace;

oneDPolyPatchType empty; //wedge

extrudeModel    linearNormal;

nLayers         30;

expansionRatio  1;

adaptMesh       true; // mapped for both

linearNormalCoeffs
{
    thickness       0.02;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
