OpenFOAM/foam9tutorials/CFD/rackStorage/system/panel.setSet
faceSet panel new patchToFace panel
faceZoneSet panel new setToFaceZone panel
